MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1764/mcu.h
// Register: COG1FIS1
#define COG1FIS1 COG1FIS1
extern volatile unsigned char           COG1FIS1            __at(0x69A);
#ifndef _LIB_BUILD
asm("COG1FIS1 equ 069Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIS8                   :1;
        unsigned FIS9                   :1;
        unsigned FIS10                  :1;
        unsigned FIS11                  :1;
        unsigned FIS12                  :1;
        unsigned FIS13                  :1;
        unsigned FIS14                  :1;
    };
    struct {
        unsigned G1FIS8                 :1;
        unsigned G1FIS9                 :1;
        unsigned G1FIS10                :1;
        unsigned G1FIS11                :1;
        unsigned G1FIS12                :1;
        unsigned G1FIS13                :1;
        unsigned G1FIS14                :1;
    };
} COG1FIS1bits_t;
extern volatile COG1FIS1bits_t COG1FIS1bits __at(0x69A);
// bitfield macros
#define _COG1FIS1_FIS8_POSN                                 0x0
#define _COG1FIS1_FIS8_POSITION                             0x0
#define _COG1FIS1_FIS8_SIZE                                 0x1
#define _COG1FIS1_FIS8_LENGTH                               0x1
#define _COG1FIS1_FIS8_MASK                                 0x1
#define _COG1FIS1_FIS9_POSN                                 0x1
#define _COG1FIS1_FIS9_POSITION                             0x1
#define _COG1FIS1_FIS9_SIZE                                 0x1
#define _COG1FIS1_FIS9_LENGTH                               0x1
#define _COG1FIS1_FIS9_MASK                                 0x2
#define _COG1FIS1_FIS10_POSN                                0x2
#define _COG1FIS1_FIS10_POSITION                            0x2
#define _COG1FIS1_FIS10_SIZE                                0x1
#define _COG1FIS1_FIS10_LENGTH                              0x1
#define _COG1FIS1_FIS10_MASK                                0x4
#define _COG1FIS1_FIS11_POSN                                0x3
#define _COG1FIS1_FIS11_POSITION                            0x3
#define _COG1FIS1_FIS11_SIZE                                0x1
#define _COG1FIS1_FIS11_LENGTH                              0x1
#define _COG1FIS1_FIS11_MASK                                0x8
#define _COG1FIS1_FIS12_POSN                                0x4
#define _COG1FIS1_FIS12_POSITION                            0x4
#define _COG1FIS1_FIS12_SIZE                                0x1
#define _COG1FIS1_FIS12_LENGTH                              0x1
#define _COG1FIS1_FIS12_MASK                                0x10
#define _COG1FIS1_FIS13_POSN                                0x5
#define _COG1FIS1_FIS13_POSITION                            0x5
#define _COG1FIS1_FIS13_SIZE                                0x1
#define _COG1FIS1_FIS13_LENGTH                              0x1
#define _COG1FIS1_FIS13_MASK                                0x20
#define _COG1FIS1_FIS14_POSN                                0x6
#define _COG1FIS1_FIS14_POSITION                            0x6
#define _COG1FIS1_FIS14_SIZE                                0x1
#define _COG1FIS1_FIS14_LENGTH                              0x1
#define _COG1FIS1_FIS14_MASK                                0x40
#define _COG1FIS1_G1FIS8_POSN                               0x0
#define _COG1FIS1_G1FIS8_POSITION                           0x0
#define _COG1FIS1_G1FIS8_SIZE                               0x1
#define _COG1FIS1_G1FIS8_LENGTH                             0x1
#define _COG1FIS1_G1FIS8_MASK                               0x1
#define _COG1FIS1_G1FIS9_POSN                               0x1
#define _COG1FIS1_G1FIS9_POSITION                           0x1
#define _COG1FIS1_G1FIS9_SIZE                               0x1
#define _COG1FIS1_G1FIS9_LENGTH                             0x1
#define _COG1FIS1_G1FIS9_MASK                               0x2
#define _COG1FIS1_G1FIS10_POSN                              0x2
#define _COG1FIS1_G1FIS10_POSITION                          0x2
#define _COG1FIS1_G1FIS10_SIZE                              0x1
#define _COG1FIS1_G1FIS10_LENGTH                            0x1
#define _COG1FIS1_G1FIS10_MASK                              0x4
#define _COG1FIS1_G1FIS11_POSN                              0x3
#define _COG1FIS1_G1FIS11_POSITION                          0x3
#define _COG1FIS1_G1FIS11_SIZE                              0x1
#define _COG1FIS1_G1FIS11_LENGTH                            0x1
#define _COG1FIS1_G1FIS11_MASK                              0x8
#define _COG1FIS1_G1FIS12_POSN                              0x4
#define _COG1FIS1_G1FIS12_POSITION                          0x4
#define _COG1FIS1_G1FIS12_SIZE                              0x1
#define _COG1FIS1_G1FIS12_LENGTH                            0x1
#define _COG1FIS1_G1FIS12_MASK                              0x10
#define _COG1FIS1_G1FIS13_POSN                              0x5
#define _COG1FIS1_G1FIS13_POSITION                          0x5
#define _COG1FIS1_G1FIS13_SIZE                              0x1
#define _COG1FIS1_G1FIS13_LENGTH                            0x1
#define _COG1FIS1_G1FIS13_MASK                              0x20
#define _COG1FIS1_G1FIS14_POSN                              0x6
#define _COG1FIS1_G1FIS14_POSITION                          0x6
#define _COG1FIS1_G1FIS14_SIZE                              0x1
#define _COG1FIS1_G1FIS14_LENGTH                            0x1
#define _COG1FIS1_G1FIS14_MASK                              0x40

// Register: COG1FSIM0
#define COG1FSIM0 COG1FSIM0
extern volatile unsigned char           COG1FSIM0           __at(0x69B);
#ifndef _LIB_BUILD
asm("COG1FSIM0 equ 069Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSIM0                  :1;
        unsigned FSIM1                  :1;
        unsigned FSIM2                  :1;
        unsigned FSIM3                  :1;
        unsigned FSIM4                  :1;
        unsigned FSIM5                  :1;
        unsigned FSIM6                  :1;
        unsigned FSIM7                  :1;
    };
    struct {
        unsigned G1FSIM0                :1;
        unsigned G1FSIM1                :1;
        unsigned G1FSIM2                :1;
        unsigned G1FSIM3                :1;
        unsigned G1FSIM4                :1;
        unsigned G1FSIM5                :1;
        unsigned G1FSIM6                :1;
        unsigned G1FSIM7                :1;
    };
} COG1FSIM0bits_t;
extern volatile COG1FSIM0bits_t COG1FSIM0bits __at(0x69B);
// bitfield macros
#define _COG1FSIM0_FSIM0_POSN                               0x0
#define _COG1FSIM0_FSIM0_POSITION                           0x0
#define _COG1FSIM0_FSIM0_SIZE                               0x1
#define _COG1FSIM0_FSIM0_LENGTH                             0x1
#define _COG1FSIM0_FSIM0_MASK                               0x1
#define _COG1FSIM0_FSIM1_POSN                               0x1
#define _COG1FSIM0_FSIM1_POSITION                           0x1
#define _COG1FSIM0_FSIM1_SIZE                               0x1
#define _COG1FSIM0_FSIM1_LENGTH                             0x1
#define _COG1FSIM0_FSIM1_MASK                               0x2
#define _COG1FSIM0_FSIM2_POSN                               0x2
#define _COG1FSIM0_FSIM2_POSITION                           0x2
#define _COG1FSIM0_FSIM2_SIZE                               0x1
#define _COG1FSIM0_FSIM2_LENGTH                             0x1
#define _COG1FSIM0_FSIM2_MASK                               0x4
#define _COG1FSIM0_FSIM3_POSN                               0x3
#define _COG1FSIM0_FSIM3_POSITION                           0x3
#define _COG1FSIM0_FSIM3_SIZE                               0x1
#define _COG1FSIM0_FSIM3_LENGTH                             0x1
#define _COG1FSIM0_FSIM3_MASK                               0x8
#define _COG1FSIM0_FSIM4_POSN                               0x4
#define _COG1FSIM0_FSIM4_POSITION                           0x4
#define _COG1FSIM0_FSIM4_SIZE                               0x1
#define _COG1FSIM0_FSIM4_LENGTH                             0x1
#define _COG1FSIM0_FSIM4_MASK                               0x10
#define _COG1FSIM0_FSIM5_POSN                               0x5
#define _COG1FSIM0_FSIM5_POSITION                           0x5
#define _COG1FSIM0_FSIM5_SIZE                               0x1
#define _COG1FSIM0_FSIM5_LENGTH                             0x1
#define _COG1FSIM0_FSIM5_MASK                               0x20
#define _COG1FSIM0_FSIM6_POSN                               0x6
#define _COG1FSIM0_FSIM6_POSITION                           0x6
#define _COG1FSIM0_FSIM6_SIZE                               0x1
#define _COG1FSIM0_FSIM6_LENGTH                             0x1
#define _COG1FSIM0_FSIM6_MASK                               0x40
#define _COG1FSIM0_FSIM7_POSN                               0x7
#define _COG1FSIM0_FSIM7_POSITION                           0x7
#define _COG1FSIM0_FSIM7_SIZE                               0x1
#define _COG1FSIM0_FSIM7_LENGTH                             0x1
#define _COG1FSIM0_FSIM7_MASK                               0x80
#define _COG1FSIM0_G1FSIM0_POSN                             0x0
#define _COG1FSIM0_G1FSIM0_POSITION                         0x0
#define _COG1FSIM0_G1FSIM0_SIZE                             0x1
#define _COG1FSIM0_G1FSIM0_LENGTH                           0x1
#define _COG1FSIM0_G1FSIM0_MASK                             0x1
#define _COG1FSIM0_G1FSIM1_POSN                             0x1
#define _COG1FSIM0_G1FSIM1_POSITION                         0x1
#define _COG1FSIM0_G1FSIM1_SIZE                             0x1
#define _COG1FSIM0_G1FSIM1_LENGTH                           0x1
#define _COG1FSIM0_G1FSIM1_MASK                             0x2
#define _COG1FSIM0_G1FSIM2_POSN                             0x2
#define _COG1FSIM0_G1FSIM2_POSITION                         0x2
#define _COG1FSIM0_G1FSIM2_SIZE                             0x1
#define _COG1FSIM0_G1FSIM2_LENGTH                           0x1
#define _COG1FSIM0_G1FSIM2_MASK                             0x4
#define _COG1FSIM0_G1FSIM3_POSN                             0x3
#define _COG1FSIM0_G1FSIM3_POSITION                         0x3
#define _COG1FSIM0_G1FSIM3_SIZE                             0x1
#define _COG1FSIM0_G1FSIM3_LENGTH                           0x1
#define _COG1FSIM0_G1FSIM3_MASK                             0x8
#define _COG1FSIM0_G1FSIM4_POSN                             0x4
#define _COG1FSIM0_G1FSIM4_POSITION                         0x4
#define _COG1FSIM0_G1FSIM4_SIZE                             0x1
#define _COG1FSIM0_G1FSIM4_LENGTH                           0x1
#define _COG1FSIM0_G1FSIM4_MASK                             0x10
#define _COG1FSIM0_G1FSIM5_POSN                             0x5
#define _COG1FSIM0_G1FSIM5_POSITION                         0x5
#define _COG1FSIM0_G1FSIM5_SIZE                             0x1
#define _COG1FSIM0_G1FSIM5_LENGTH                           0x1
#define _COG1FSIM0_G1FSIM5_MASK                             0x20
#define _COG1FSIM0_G1FSIM6_POSN                             0x6
#define _COG1FSIM0_G1FSIM6_POSITION                         0x6
#define _COG1FSIM0_G1FSIM6_SIZE                             0x1
#define _COG1FSIM0_G1FSIM6_LENGTH                           0x1
#define _COG1FSIM0_G1FSIM6_MASK                             0x40
#define _COG1FSIM0_G1FSIM7_POSN                             0x7
#define _COG1FSIM0_G1FSIM7_POSITION                         0x7
#define _COG1FSIM0_G1FSIM7_SIZE                             0x1
#define _COG1FSIM0_G1FSIM7_LENGTH                           0x1
#define _COG1FSIM0_G1FSIM7_MASK                             0x80

// Register: COG1FSIM1
#define COG1FSIM1 COG1FSIM1
extern volatile unsigned char           COG1FSIM1           __at(0x69C);
#ifndef _LIB_BUILD
asm("COG1FSIM1 equ 069Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSIM8                  :1;
        unsigned FSIM9                  :1;
        unsigned FSIM10                 :1;
        unsigned FSIM11                 :1;
        unsigned FSIM12                 :1;
        unsigned FSIM13                 :1;
        unsigned FSIM14                 :1;
    };
    struct {
        unsigned G1FSIM8                :1;
        unsigned G1FSIM9                :1;
        unsigned G1FSIM10               :1;
        unsigned G1FSIM11               :1;
        unsigned G1FSIM12               :1;
        unsigned G1FSIM13               :1;
        unsigned G1FSIM14               :1;
    };
} COG1FSIM1bits_t;
extern volatile COG1FSIM1bits_t COG1FSIM1bits __at(0x69C);
// bitfield macros
#define _COG1FSIM1_FSIM8_POSN                               0x0
#define _COG1FSIM1_FSIM8_POSITION                           0x0
#define _COG1FSIM1_FSIM8_SIZE                               0x1
#define _COG1FSIM1_FSIM8_LENGTH                             0x1
#define _COG1FSIM1_FSIM8_MASK                               0x1
#define _COG1FSIM1_FSIM9_POSN                               0x1
#define _COG1FSIM1_FSIM9_POSITION                           0x1
#define _COG1FSIM1_FSIM9_SIZE                               0x1
#define _COG1FSIM1_FSIM9_LENGTH                             0x1
#define _COG1FSIM1_FSIM9_MASK                               0x2
#define _COG1FSIM1_FSIM10_POSN                              0x2
#define _COG1FSIM1_FSIM10_POSITION                          0x2
#define _COG1FSIM1_FSIM10_SIZE                              0x1
#define _COG1FSIM1_FSIM10_LENGTH                            0x1
#define _COG1FSIM1_FSIM10_MASK                              0x4
#define _COG1FSIM1_FSIM11_POSN                              0x3
#define _COG1FSIM1_FSIM11_POSITION                          0x3
#define _COG1FSIM1_FSIM11_SIZE                              0x1
#define _COG1FSIM1_FSIM11_LENGTH                            0x1
#define _COG1FSIM1_FSIM11_MASK                              0x8
#define _COG1FSIM1_FSIM12_POSN                              0x4
#define _COG1FSIM1_FSIM12_POSITION                          0x4
#define _COG1FSIM1_FSIM12_SIZE                              0x1
#define _COG1FSIM1_FSIM12_LENGTH                            0x1
#define _COG1FSIM1_FSIM12_MASK                              0x10
#define _COG1FSIM1_FSIM13_POSN                              0x5
#define _COG1FSIM1_FSIM13_POSITION                          0x5
#define _COG1FSIM1_FSIM13_SIZE                              0x1
#define _COG1FSIM1_FSIM13_LENGTH                            0x1
#define _COG1FSIM1_FSIM13_MASK                              0x20
#define _COG1FSIM1_FSIM14_POSN                              0x6
#define _COG1FSIM1_FSIM14_POSITION                          0x6
#define _COG1FSIM1_FSIM14_SIZE                              0x1
#define _COG1FSIM1_FSIM14_LENGTH                            0x1
#define _COG1FSIM1_FSIM14_MASK                              0x40
#define _COG1FSIM1_G1FSIM8_POSN                             0x0
#define _COG1FSIM1_G1FSIM8_POSITION                         0x0
#define _COG1FSIM1_G1FSIM8_SIZE                             0x1
#define _COG1FSIM1_G1FSIM8_LENGTH                           0x1
#define _COG1FSIM1_G1FSIM8_MASK                             0x1
#define _COG1FSIM1_G1FSIM9_POSN                             0x1
#define _COG1FSIM1_G1FSIM9_POSITION                         0x1
#define _COG1FSIM1_G1FSIM9_SIZE                             0x1
#define _COG1FSIM1_G1FSIM9_LENGTH                           0x1
#define _COG1FSIM1_G1FSIM9_MASK                             0x2
#define _COG1FSIM1_G1FSIM10_POSN                            0x2
#define _COG1FSIM1_G1FSIM10_POSITION                        0x2
#define _COG1FSIM1_G1FSIM10_SIZE                            0x1
#define _COG1FSIM1_G1FSIM10_LENGTH                          0x1
#define _COG1FSIM1_G1FSIM10_MASK                            0x4
#define _COG1FSIM1_G1FSIM11_POSN                            0x3
#define _COG1FSIM1_G1FSIM11_POSITION                        0x3
#define _COG1FSIM1_G1FSIM11_SIZE                            0x1
#define _COG1FSIM1_G1FSIM11_LENGTH                          0x1
#define _COG1FSIM1_G1FSIM11_MASK                            0x8
#define _COG1FSIM1_G1FSIM12_POSN                            0x4
#define _COG1FSIM1_G1FSIM12_POSITION                        0x4
#define _COG1FSIM1_G1FSIM12_SIZE                            0x1
#define _COG1FSIM1_G1FSIM12_LENGTH                          0x1
#define _COG1FSIM1_G1FSIM12_MASK                            0x10
#define _COG1FSIM1_G1FSIM13_POSN                            0x5
#define _COG1FSIM1_G1FSIM13_POSITION                        0x5
#define _COG1FSIM1_G1FSIM13_SIZE                            0x1
#define _COG1FSIM1_G1FSIM13_LENGTH                          0x1
#define _COG1FSIM1_G1FSIM13_MASK                            0x20
#define _COG1FSIM1_G1FSIM14_POSN                            0x6
#define _COG1FSIM1_G1FSIM14_POSITION                        0x6
#define _COG1FSIM1_G1FSIM14_SIZE                            0x1
#define _COG1FSIM1_G1FSIM14_LENGTH                          0x1
#define _COG1FSIM1_G1FSIM14_MASK                            0x40

