MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1764/mcu.h
extern volatile COG1ASD1bits_t COG1ASD1bits __at(0x69E);
// bitfield macros
#define _COG1ASD1_AS0E_POSN                                 0x0
#define _COG1ASD1_AS0E_POSITION                             0x0
#define _COG1ASD1_AS0E_SIZE                                 0x1
#define _COG1ASD1_AS0E_LENGTH                               0x1
#define _COG1ASD1_AS0E_MASK                                 0x1
#define _COG1ASD1_AS1E_POSN                                 0x1
#define _COG1ASD1_AS1E_POSITION                             0x1
#define _COG1ASD1_AS1E_SIZE                                 0x1
#define _COG1ASD1_AS1E_LENGTH                               0x1
#define _COG1ASD1_AS1E_MASK                                 0x2
#define _COG1ASD1_AS2E_POSN                                 0x2
#define _COG1ASD1_AS2E_POSITION                             0x2
#define _COG1ASD1_AS2E_SIZE                                 0x1
#define _COG1ASD1_AS2E_LENGTH                               0x1
#define _COG1ASD1_AS2E_MASK                                 0x4
#define _COG1ASD1_AS3E_POSN                                 0x3
#define _COG1ASD1_AS3E_POSITION                             0x3
#define _COG1ASD1_AS3E_SIZE                                 0x1
#define _COG1ASD1_AS3E_LENGTH                               0x1
#define _COG1ASD1_AS3E_MASK                                 0x8
#define _COG1ASD1_AS4E_POSN                                 0x4
#define _COG1ASD1_AS4E_POSITION                             0x4
#define _COG1ASD1_AS4E_SIZE                                 0x1
#define _COG1ASD1_AS4E_LENGTH                               0x1
#define _COG1ASD1_AS4E_MASK                                 0x10
#define _COG1ASD1_AS5E_POSN                                 0x5
#define _COG1ASD1_AS5E_POSITION                             0x5
#define _COG1ASD1_AS5E_SIZE                                 0x1
#define _COG1ASD1_AS5E_LENGTH                               0x1
#define _COG1ASD1_AS5E_MASK                                 0x20
#define _COG1ASD1_AS6E_POSN                                 0x6
#define _COG1ASD1_AS6E_POSITION                             0x6
#define _COG1ASD1_AS6E_SIZE                                 0x1
#define _COG1ASD1_AS6E_LENGTH                               0x1
#define _COG1ASD1_AS6E_MASK                                 0x40
#define _COG1ASD1_AS7E_POSN                                 0x7
#define _COG1ASD1_AS7E_POSITION                             0x7
#define _COG1ASD1_AS7E_SIZE                                 0x1
#define _COG1ASD1_AS7E_LENGTH                               0x1
#define _COG1ASD1_AS7E_MASK                                 0x80
#define _COG1ASD1_G1AS0E_POSN                               0x0
#define _COG1ASD1_G1AS0E_POSITION                           0x0
#define _COG1ASD1_G1AS0E_SIZE                               0x1
#define _COG1ASD1_G1AS0E_LENGTH                             0x1
#define _COG1ASD1_G1AS0E_MASK                               0x1
#define _COG1ASD1_G1AS1E_POSN                               0x1
#define _COG1ASD1_G1AS1E_POSITION                           0x1
#define _COG1ASD1_G1AS1E_SIZE                               0x1
#define _COG1ASD1_G1AS1E_LENGTH                             0x1
#define _COG1ASD1_G1AS1E_MASK                               0x2
#define _COG1ASD1_G1AS2E_POSN                               0x2
#define _COG1ASD1_G1AS2E_POSITION                           0x2
#define _COG1ASD1_G1AS2E_SIZE                               0x1
#define _COG1ASD1_G1AS2E_LENGTH                             0x1
#define _COG1ASD1_G1AS2E_MASK                               0x4
#define _COG1ASD1_G1AS3E_POSN                               0x3
#define _COG1ASD1_G1AS3E_POSITION                           0x3
#define _COG1ASD1_G1AS3E_SIZE                               0x1
#define _COG1ASD1_G1AS3E_LENGTH                             0x1
#define _COG1ASD1_G1AS3E_MASK                               0x8
#define _COG1ASD1_G1AS4E_POSN                               0x4
#define _COG1ASD1_G1AS4E_POSITION                           0x4
#define _COG1ASD1_G1AS4E_SIZE                               0x1
#define _COG1ASD1_G1AS4E_LENGTH                             0x1
#define _COG1ASD1_G1AS4E_MASK                               0x10
#define _COG1ASD1_G1AS5E_POSN                               0x5
#define _COG1ASD1_G1AS5E_POSITION                           0x5
#define _COG1ASD1_G1AS5E_SIZE                               0x1
#define _COG1ASD1_G1AS5E_LENGTH                             0x1
#define _COG1ASD1_G1AS5E_MASK                               0x20
#define _COG1ASD1_G1AS6E_POSN                               0x6
#define _COG1ASD1_G1AS6E_POSITION                           0x6
#define _COG1ASD1_G1AS6E_SIZE                               0x1
#define _COG1ASD1_G1AS6E_LENGTH                             0x1
#define _COG1ASD1_G1AS6E_MASK                               0x40
#define _COG1ASD1_G1AS7E_POSN                               0x7
#define _COG1ASD1_G1AS7E_POSITION                           0x7
#define _COG1ASD1_G1AS7E_SIZE                               0x1
#define _COG1ASD1_G1AS7E_LENGTH                             0x1
#define _COG1ASD1_G1AS7E_MASK                               0x80

// Register: COG1STR
#define COG1STR COG1STR
extern volatile unsigned char           COG1STR             __at(0x69F);
#ifndef _LIB_BUILD
asm("COG1STR equ 069Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned SDATA                  :1;
        unsigned SDATB                  :1;
        unsigned SDATC                  :1;
        unsigned SDATD                  :1;
    };
    struct {
        unsigned G1STRA                 :1;
        unsigned G1STRB                 :1;
        unsigned G1STRC                 :1;
        unsigned G1STRD                 :1;
        unsigned G1SDATA                :1;
        unsigned G1SDATB                :1;
        unsigned G1SDATC                :1;
        unsigned G1SDATD                :1;
    };
} COG1STRbits_t;
extern volatile COG1STRbits_t COG1STRbits __at(0x69F);
// bitfield macros
#define _COG1STR_STRA_POSN                                  0x0
#define _COG1STR_STRA_POSITION                              0x0
#define _COG1STR_STRA_SIZE                                  0x1
#define _COG1STR_STRA_LENGTH                                0x1
#define _COG1STR_STRA_MASK                                  0x1
#define _COG1STR_STRB_POSN                                  0x1
#define _COG1STR_STRB_POSITION                              0x1
#define _COG1STR_STRB_SIZE                                  0x1
#define _COG1STR_STRB_LENGTH                                0x1
#define _COG1STR_STRB_MASK                                  0x2
#define _COG1STR_STRC_POSN                                  0x2
#define _COG1STR_STRC_POSITION                              0x2
#define _COG1STR_STRC_SIZE                                  0x1
#define _COG1STR_STRC_LENGTH                                0x1
#define _COG1STR_STRC_MASK                                  0x4
#define _COG1STR_STRD_POSN                                  0x3
#define _COG1STR_STRD_POSITION                              0x3
#define _COG1STR_STRD_SIZE                                  0x1
#define _COG1STR_STRD_LENGTH                                0x1
#define _COG1STR_STRD_MASK                                  0x8
#define _COG1STR_SDATA_POSN                                 0x4
#define _COG1STR_SDATA_POSITION                             0x4
#define _COG1STR_SDATA_SIZE                                 0x1
#define _COG1STR_SDATA_LENGTH                               0x1
#define _COG1STR_SDATA_MASK                                 0x10
#define _COG1STR_SDATB_POSN                                 0x5
#define _COG1STR_SDATB_POSITION                             0x5
#define _COG1STR_SDATB_SIZE                                 0x1
#define _COG1STR_SDATB_LENGTH                               0x1
#define _COG1STR_SDATB_MASK                                 0x20
#define _COG1STR_SDATC_POSN                                 0x6
#define _COG1STR_SDATC_POSITION                             0x6
#define _COG1STR_SDATC_SIZE                                 0x1
#define _COG1STR_SDATC_LENGTH                               0x1
#define _COG1STR_SDATC_MASK                                 0x40
#define _COG1STR_SDATD_POSN                                 0x7
#define _COG1STR_SDATD_POSITION                             0x7
#define _COG1STR_SDATD_SIZE                                 0x1
#define _COG1STR_SDATD_LENGTH                               0x1
#define _COG1STR_SDATD_MASK                                 0x80
#define _COG1STR_G1STRA_POSN                                0x0
#define _COG1STR_G1STRA_POSITION                            0x0
#define _COG1STR_G1STRA_SIZE                                0x1
#define _COG1STR_G1STRA_LENGTH                              0x1
#define _COG1STR_G1STRA_MASK                                0x1
#define _COG1STR_G1STRB_POSN                                0x1
#define _COG1STR_G1STRB_POSITION                            0x1
#define _COG1STR_G1STRB_SIZE                                0x1
#define _COG1STR_G1STRB_LENGTH                              0x1
#define _COG1STR_G1STRB_MASK                                0x2
#define _COG1STR_G1STRC_POSN                                0x2
#define _COG1STR_G1STRC_POSITION                            0x2
#define _COG1STR_G1STRC_SIZE                                0x1
#define _COG1STR_G1STRC_LENGTH                              0x1
#define _COG1STR_G1STRC_MASK                                0x4
#define _COG1STR_G1STRD_POSN                                0x3
#define _COG1STR_G1STRD_POSITION                            0x3
#define _COG1STR_G1STRD_SIZE                                0x1
#define _COG1STR_G1STRD_LENGTH                              0x1
#define _COG1STR_G1STRD_MASK                                0x8
#define _COG1STR_G1SDATA_POSN                               0x4
#define _COG1STR_G1SDATA_POSITION                           0x4
#define _COG1STR_G1SDATA_SIZE                               0x1
#define _COG1STR_G1SDATA_LENGTH                             0x1
#define _COG1STR_G1SDATA_MASK                               0x10
#define _COG1STR_G1SDATB_POSN                               0x5
#define _COG1STR_G1SDATB_POSITION                           0x5
#define _COG1STR_G1SDATB_SIZE                               0x1
#define _COG1STR_G1SDATB_LENGTH                             0x1
#define _COG1STR_G1SDATB_MASK                               0x20
#define _COG1STR_G1SDATC_POSN                               0x6
#define _COG1STR_G1SDATC_POSITION                           0x6
#define _COG1STR_G1SDATC_SIZE                               0x1
#define _COG1STR_G1SDATC_LENGTH                             0x1
#define _COG1STR_G1SDATC_MASK                               0x40
#define _COG1STR_G1SDATD_POSN                               0x7
#define _COG1STR_G1SDATD_POSITION                           0x7
#define _COG1STR_G1SDATD_SIZE                               0x1
#define _COG1STR_G1SDATD_LENGTH                             0x1
#define _COG1STR_G1SDATD_MASK                               0x80

// Register: PRG1RTSS
#define PRG1RTSS PRG1RTSS
extern volatile unsigned char           PRG1RTSS            __at(0x794);
#ifndef _LIB_BUILD
asm("PRG1RTSS equ 0794h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTSS                   :8;
    };
    struct {
        unsigned RTSS0                  :1;
        unsigned RTSS1                  :1;
        unsigned RTSS2                  :1;
        unsigned RTSS3                  :1;
    };
    struct {
        unsigned RG1RTSS0               :1;
        unsigned RG1RTSS1               :1;
        unsigned RG1RTSS2               :1;
        unsigned RG1RTSS3               :1;
    };
} PRG1RTSSbits_t;
extern volatile PRG1RTSSbits_t PRG1RTSSbits __at(0x794);
// bitfield macros
#define _PRG1RTSS_RTSS_POSN                                 0x0
#define _PRG1RTSS_RTSS_POSITION                             0x0
#define _PRG1RTSS_RTSS_SIZE                                 0x8
#define _PRG1RTSS_RTSS_LENGTH                               0x8
#define _PRG1RTSS_RTSS_MASK                                 0xFF
#define _PRG1RTSS_RTSS0_POSN                                0x0
#define _PRG1RTSS_RTSS0_POSITION                            0x0
#define _PRG1RTSS_RTSS0_SIZE                                0x1
#define _PRG1RTSS_RTSS0_LENGTH                              0x1
#define _PRG1RTSS_RTSS0_MASK                                0x1
#define _PRG1RTSS_RTSS1_POSN                                0x1
#define _PRG1RTSS_RTSS1_POSITION                            0x1
#define _PRG1RTSS_RTSS1_SIZE                                0x1
#define _PRG1RTSS_RTSS1_LENGTH                              0x1
#define _PRG1RTSS_RTSS1_MASK                                0x2
#define _PRG1RTSS_RTSS2_POSN                                0x2
#define _PRG1RTSS_RTSS2_POSITION                            0x2
#define _PRG1RTSS_RTSS2_SIZE                                0x1
#define _PRG1RTSS_RTSS2_LENGTH                              0x1
#define _PRG1RTSS_RTSS2_MASK                                0x4
#define _PRG1RTSS_RTSS3_POSN                                0x3
#define _PRG1RTSS_RTSS3_POSITION                            0x3
#define _PRG1RTSS_RTSS3_SIZE                                0x1
#define _PRG1RTSS_RTSS3_LENGTH                              0x1
#define _PRG1RTSS_RTSS3_MASK                                0x8
#define _PRG1RTSS_RG1RTSS0_POSN                             0x0
#define _PRG1RTSS_RG1RTSS0_POSITION                         0x0
#define _PRG1RTSS_RG1RTSS0_SIZE                             0x1
#define _PRG1RTSS_RG1RTSS0_LENGTH                           0x1
#define _PRG1RTSS_RG1RTSS0_MASK                             0x1
#define _PRG1RTSS_RG1RTSS1_POSN                             0x1
#define _PRG1RTSS_RG1RTSS1_POSITION                         0x1
#define _PRG1RTSS_RG1RTSS1_SIZE                             0x1
#define _PRG1RTSS_RG1RTSS1_LENGTH                           0x1
#define _PRG1RTSS_RG1RTSS1_MASK                             0x2
#define _PRG1RTSS_RG1RTSS2_POSN                             0x2
#define _PRG1RTSS_RG1RTSS2_POSITION                         0x2
#define _PRG1RTSS_RG1RTSS2_SIZE                             0x1
#define _PRG1RTSS_RG1RTSS2_LENGTH                           0x1
#define _PRG1RTSS_RG1RTSS2_MASK                             0x4
#define _PRG1RTSS_RG1RTSS3_POSN                             0x3
#define _PRG1RTSS_RG1RTSS3_POSITION                         0x3
#define _PRG1RTSS_RG1RTSS3_SIZE                             0x1
#define _PRG1RTSS_RG1RTSS3_LENGTH                           0x1
#define _PRG1RTSS_RG1RTSS3_MASK                             0x8

// Register: PRG1FTSS
#define PRG1FTSS PRG1FTSS
extern volatile unsigned char           PRG1FTSS            __at(0x795);
#ifndef _LIB_BUILD
asm("PRG1FTSS equ 0795h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FTSS                   :8;
    };
    struct {
        unsigned FTSS0                  :1;
        unsigned FTSS1                  :1;
        unsigned FTSS2                  :1;
        unsigned FTSS3                  :1;
    };
    struct {
        unsigned RG1FTSS0               :1;
        unsigned RG1FTSS1               :1;
        unsigned RG1FTSS2               :1;
        unsigned RG1FTSS3               :1;
    };
} PRG1FTSSbits_t;
extern volatile PRG1FTSSbits_t PRG1FTSSbits __at(0x795);
// bitfield macros
#define _PRG1FTSS_FTSS_POSN                                 0x0
#define _PRG1FTSS_FTSS_POSITION                             0x0
#define _PRG1FTSS_FTSS_SIZE                                 0x8
#define _PRG1FTSS_FTSS_LENGTH                               0x8
#define _PRG1FTSS_FTSS_MASK                                 0xFF
#define _PRG1FTSS_FTSS0_POSN                                0x0
#define _PRG1FTSS_FTSS0_POSITION                            0x0
#define _PRG1FTSS_FTSS0_SIZE                                0x1
#define _PRG1FTSS_FTSS0_LENGTH                              0x1
#define _PRG1FTSS_FTSS0_MASK                                0x1
#define _PRG1FTSS_FTSS1_POSN                                0x1
#define _PRG1FTSS_FTSS1_POSITION                            0x1
#define _PRG1FTSS_FTSS1_SIZE                                0x1
#define _PRG1FTSS_FTSS1_LENGTH                              0x1
#define _PRG1FTSS_FTSS1_MASK                                0x2
#define _PRG1FTSS_FTSS2_POSN                                0x2
#define _PRG1FTSS_FTSS2_POSITION                            0x2
#define _PRG1FTSS_FTSS2_SIZE                                0x1
#define _PRG1FTSS_FTSS2_LENGTH                              0x1
#define _PRG1FTSS_FTSS2_MASK                                0x4
#define _PRG1FTSS_FTSS3_POSN                                0x3
#define _PRG1FTSS_FTSS3_POSITION                            0x3
#define _PRG1FTSS_FTSS3_SIZE                                0x1
#define _PRG1FTSS_FTSS3_LENGTH                              0x1
#define _PRG1FTSS_FTSS3_MASK                                0x8
#define _PRG1FTSS_RG1FTSS0_POSN                             0x0
#define _PRG1FTSS_RG1FTSS0_POSITION                         0x0
#define _PRG1FTSS_RG1FTSS0_SIZE                             0x1
#define _PRG1FTSS_RG1FTSS0_LENGTH                           0x1
#define _PRG1FTSS_RG1FTSS0_MASK                             0x1
#define _PRG1FTSS_RG1FTSS1_POSN                             0x1
#define _PRG1FTSS_RG1FTSS1_POSITION                         0x1
#define _PRG1FTSS_RG1FTSS1_SIZE                             0x1
#define _PRG1FTSS_RG1FTSS1_LENGTH                           0x1
#define _PRG1FTSS_RG1FTSS1_MASK                             0x2
#define _PRG1FTSS_RG1FTSS2_POSN                             0x2
#define _PRG1FTSS_RG1FTSS2_POSITION                         0x2
#define _PRG1FTSS_RG1FTSS2_SIZE                             0x1
#define _PRG1FTSS_RG1FTSS2_LENGTH                           0x1
#define _PRG1FTSS_RG1FTSS2_MASK                             0x4
#define _PRG1FTSS_RG1FTSS3_POSN                             0x3
#define _PRG1FTSS_RG1FTSS3_POSITION                         0x3
#define _PRG1FTSS_RG1FTSS3_SIZE                             0x1
#define _PRG1FTSS_RG1FTSS3_LENGTH                           0x1
#define _PRG1FTSS_RG1FTSS3_MASK                             0x8

// Register: PRG1INS
#define PRG1INS PRG1INS
extern volatile unsigned char           PRG1INS             __at(0x796);
#ifndef _LIB_BUILD
asm("PRG1INS equ 0796h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INS                    :8;
    };
    struct {
        unsigned INS0                   :1;
        unsigned INS1                   :1;
        unsigned INS2                   :1;
        unsigned INS3                   :1;
    };
    struct {
        unsigned RG1INS0                :1;
        unsigned RG1INS1                :1;
        unsigned RG1INS2                :1;
        unsigned RG1INS3                :1;
    };
} PRG1INSbits_t;
extern volatile PRG1INSbits_t PRG1INSbits __at(0x796);
// bitfield macros
#define _PRG1INS_INS_POSN                                   0x0
#define _PRG1INS_INS_POSITION                               0x0
#define _PRG1INS_INS_SIZE                                   0x8
#define _PRG1INS_INS_LENGTH                                 0x8
#define _PRG1INS_INS_MASK                                   0xFF
#define _PRG1INS_INS0_POSN                                  0x0
#define _PRG1INS_INS0_POSITION                              0x0
#define _PRG1INS_INS0_SIZE                                  0x1
#define _PRG1INS_INS0_LENGTH                                0x1
#define _PRG1INS_INS0_MASK                                  0x1
#define _PRG1INS_INS1_POSN                                  0x1
#define _PRG1INS_INS1_POSITION                              0x1
#define _PRG1INS_INS1_SIZE                                  0x1
#define _PRG1INS_INS1_LENGTH                                0x1
#define _PRG1INS_INS1_MASK                                  0x2
#define _PRG1INS_INS2_POSN                                  0x2
#define _PRG1INS_INS2_POSITION                              0x2
#define _PRG1INS_INS2_SIZE                                  0x1
#define _PRG1INS_INS2_LENGTH                                0x1
#define _PRG1INS_INS2_MASK                                  0x4
#define _PRG1INS_INS3_POSN                                  0x3
#define _PRG1INS_INS3_POSITION                              0x3
#define _PRG1INS_INS3_SIZE                                  0x1
#define _PRG1INS_INS3_LENGTH                                0x1
#define _PRG1INS_INS3_MASK                                  0x8
#define _PRG1INS_RG1INS0_POSN                               0x0
#define _PRG1INS_RG1INS0_POSITION                           0x0
#define _PRG1INS_RG1INS0_SIZE                               0x1
#define _PRG1INS_RG1INS0_LENGTH                             0x1
#define _PRG1INS_RG1INS0_MASK                               0x1
#define _PRG1INS_RG1INS1_POSN                               0x1
#define _PRG1INS_RG1INS1_POSITION                           0x1
#define _PRG1INS_RG1INS1_SIZE                               0x1
#define _PRG1INS_RG1INS1_LENGTH                             0x1
#define _PRG1INS_RG1INS1_MASK                               0x2
#define _PRG1INS_RG1INS2_POSN                               0x2
#define _PRG1INS_RG1INS2_POSITION                           0x2
#define _PRG1INS_RG1INS2_SIZE                               0x1
#define _PRG1INS_RG1INS2_LENGTH                             0x1
#define _PRG1INS_RG1INS2_MASK                               0x4
#define _PRG1INS_RG1INS3_POSN                               0x3
#define _PRG1INS_RG1INS3_POSITION                           0x3
#define _PRG1INS_RG1INS3_SIZE                               0x1
#define _PRG1INS_RG1INS3_LENGTH                             0x1
#define _PRG1INS_RG1INS3_MASK                               0x8

// Register: PRG1CON0
#define PRG1CON0 PRG1CON0
extern volatile unsigned char           PRG1CON0            __at(0x797);
#ifndef _LIB_BUILD
asm("PRG1CON0 equ 0797h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GO                     :1;
        unsigned OS                     :1;
        unsigned MODE                   :2;
        unsigned REDG                   :1;
        unsigned FEDG                   :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
    struct {
        unsigned RG1GO                  :1;
        unsigned RG1OS                  :1;
        unsigned RG1MODE                :2;
        unsigned RG1REDG                :1;
        unsigned RG1FEDG                :1;
        unsigned                        :1;
        unsigned RG1EN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned RG1MODE0               :1;
        unsigned RG1MODE1               :1;
    };
} PRG1CON0bits_t;
