MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1764/mcu.h
extern volatile __bit                   DBR5                __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(COG1DBR,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// PWM3DCL<DC0>
extern volatile __bit                   DC0                 __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 DC0_bit             _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<DC1>
extern volatile __bit                   DC1                 __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 DC1_bit             _BIT_ACCESS(PWM3DCL,7)
// PWM3DCH<DC2>
extern volatile __bit                   DC2                 __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 DC2_bit             _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<DC3>
extern volatile __bit                   DC3                 __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 DC3_bit             _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<DC4>
extern volatile __bit                   DC4                 __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 DC4_bit             _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<DC5>
extern volatile __bit                   DC5                 __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 DC5_bit             _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<DC6>
extern volatile __bit                   DC6                 __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 DC6_bit             _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<DC7>
extern volatile __bit                   DC7                 __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 DC7_bit             _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<DC8>
extern volatile __bit                   DC8                 __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 DC8_bit             _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<DC9>
extern volatile __bit                   DC9                 __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 DC9_bit             _BIT_ACCESS(PWM3DCH,7)
// PWM5INTE<DCIE>
extern volatile __bit                   DCIE                __at(0x6CE1);	// @ (0xD9C * 8 + 1)
#define                                 DCIE_bit            _BIT_ACCESS(PWM5INTE,1)
// PWM5INTF<DCIF>
extern volatile __bit                   DCIF                __at(0x6CE9);	// @ (0xD9D * 8 + 1)
#define                                 DCIF_bit            _BIT_ACCESS(PWM5INTF,1)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x10B8);	// @ (0x217 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x10A5);	// @ (0x214 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// COG1CON1<FDBS>
extern volatile __bit                   FDBS                __at(0x34A6);	// @ (0x694 * 8 + 6)
#define                                 FDBS_bit            _BIT_ACCESS(COG1CON1,6)
// PRG1CON0<FEDG>
extern volatile __bit                   FEDG                __at(0x3CBD);	// @ (0x797 * 8 + 5)
#define                                 FEDG_bit            _BIT_ACCESS(PRG1CON0,5)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// COG1FIS0<FIS0>
extern volatile __bit                   FIS0                __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 FIS0_bit            _BIT_ACCESS(COG1FIS0,0)
// COG1FIS0<FIS1>
extern volatile __bit                   FIS1                __at(0x34C9);	// @ (0x699 * 8 + 1)
#define                                 FIS1_bit            _BIT_ACCESS(COG1FIS0,1)
// COG1FIS1<FIS10>
extern volatile __bit                   FIS10               __at(0x34D2);	// @ (0x69A * 8 + 2)
#define                                 FIS10_bit           _BIT_ACCESS(COG1FIS1,2)
// COG1FIS1<FIS11>
extern volatile __bit                   FIS11               __at(0x34D3);	// @ (0x69A * 8 + 3)
#define                                 FIS11_bit           _BIT_ACCESS(COG1FIS1,3)
// COG1FIS1<FIS12>
extern volatile __bit                   FIS12               __at(0x34D4);	// @ (0x69A * 8 + 4)
#define                                 FIS12_bit           _BIT_ACCESS(COG1FIS1,4)
// COG1FIS1<FIS13>
extern volatile __bit                   FIS13               __at(0x34D5);	// @ (0x69A * 8 + 5)
#define                                 FIS13_bit           _BIT_ACCESS(COG1FIS1,5)
// COG1FIS1<FIS14>
extern volatile __bit                   FIS14               __at(0x34D6);	// @ (0x69A * 8 + 6)
#define                                 FIS14_bit           _BIT_ACCESS(COG1FIS1,6)
// COG1FIS0<FIS2>
extern volatile __bit                   FIS2                __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 FIS2_bit            _BIT_ACCESS(COG1FIS0,2)
// COG1FIS0<FIS3>
extern volatile __bit                   FIS3                __at(0x34CB);	// @ (0x699 * 8 + 3)
#define                                 FIS3_bit            _BIT_ACCESS(COG1FIS0,3)
// COG1FIS0<FIS4>
extern volatile __bit                   FIS4                __at(0x34CC);	// @ (0x699 * 8 + 4)
#define                                 FIS4_bit            _BIT_ACCESS(COG1FIS0,4)
// COG1FIS0<FIS5>
extern volatile __bit                   FIS5                __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 FIS5_bit            _BIT_ACCESS(COG1FIS0,5)
// COG1FIS0<FIS6>
extern volatile __bit                   FIS6                __at(0x34CE);	// @ (0x699 * 8 + 6)
#define                                 FIS6_bit            _BIT_ACCESS(COG1FIS0,6)
// COG1FIS0<FIS7>
extern volatile __bit                   FIS7                __at(0x34CF);	// @ (0x699 * 8 + 7)
#define                                 FIS7_bit            _BIT_ACCESS(COG1FIS0,7)
// COG1FIS1<FIS8>
extern volatile __bit                   FIS8                __at(0x34D0);	// @ (0x69A * 8 + 0)
#define                                 FIS8_bit            _BIT_ACCESS(COG1FIS1,0)
// COG1FIS1<FIS9>
extern volatile __bit                   FIS9                __at(0x34D1);	// @ (0x69A * 8 + 1)
#define                                 FIS9_bit            _BIT_ACCESS(COG1FIS1,1)
// DAC1CON0<FM>
extern volatile __bit                   FM                  __at(0x2C8E);	// @ (0x591 * 8 + 6)
#define                                 FM_bit              _BIT_ACCESS(DAC1CON0,6)
// CCP1CON<FMT>
extern volatile __bit                   FMT                 __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 FMT_bit             _BIT_ACCESS(CCP1CON,4)
// PRG1CON1<FPOL>
extern volatile __bit                   FPOL                __at(0x3CC1);	// @ (0x798 * 8 + 1)
#define                                 FPOL_bit            _BIT_ACCESS(PRG1CON1,1)
// PMCON1<FREE>
extern volatile __bit                   FREE                __at(0xCAC);	// @ (0x195 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(PMCON1,4)
// COG1FSIM0<FSIM0>
extern volatile __bit                   FSIM0               __at(0x34D8);	// @ (0x69B * 8 + 0)
#define                                 FSIM0_bit           _BIT_ACCESS(COG1FSIM0,0)
// COG1FSIM0<FSIM1>
extern volatile __bit                   FSIM1               __at(0x34D9);	// @ (0x69B * 8 + 1)
#define                                 FSIM1_bit           _BIT_ACCESS(COG1FSIM0,1)
// COG1FSIM1<FSIM10>
extern volatile __bit                   FSIM10              __at(0x34E2);	// @ (0x69C * 8 + 2)
#define                                 FSIM10_bit          _BIT_ACCESS(COG1FSIM1,2)
// COG1FSIM1<FSIM11>
extern volatile __bit                   FSIM11              __at(0x34E3);	// @ (0x69C * 8 + 3)
#define                                 FSIM11_bit          _BIT_ACCESS(COG1FSIM1,3)
// COG1FSIM1<FSIM12>
extern volatile __bit                   FSIM12              __at(0x34E4);	// @ (0x69C * 8 + 4)
#define                                 FSIM12_bit          _BIT_ACCESS(COG1FSIM1,4)
// COG1FSIM1<FSIM13>
extern volatile __bit                   FSIM13              __at(0x34E5);	// @ (0x69C * 8 + 5)
#define                                 FSIM13_bit          _BIT_ACCESS(COG1FSIM1,5)
// COG1FSIM1<FSIM14>
extern volatile __bit                   FSIM14              __at(0x34E6);	// @ (0x69C * 8 + 6)
#define                                 FSIM14_bit          _BIT_ACCESS(COG1FSIM1,6)
// COG1FSIM0<FSIM2>
extern volatile __bit                   FSIM2               __at(0x34DA);	// @ (0x69B * 8 + 2)
#define                                 FSIM2_bit           _BIT_ACCESS(COG1FSIM0,2)
// COG1FSIM0<FSIM3>
extern volatile __bit                   FSIM3               __at(0x34DB);	// @ (0x69B * 8 + 3)
#define                                 FSIM3_bit           _BIT_ACCESS(COG1FSIM0,3)
// COG1FSIM0<FSIM4>
extern volatile __bit                   FSIM4               __at(0x34DC);	// @ (0x69B * 8 + 4)
#define                                 FSIM4_bit           _BIT_ACCESS(COG1FSIM0,4)
// COG1FSIM0<FSIM5>
extern volatile __bit                   FSIM5               __at(0x34DD);	// @ (0x69B * 8 + 5)
#define                                 FSIM5_bit           _BIT_ACCESS(COG1FSIM0,5)
// COG1FSIM0<FSIM6>
extern volatile __bit                   FSIM6               __at(0x34DE);	// @ (0x69B * 8 + 6)
#define                                 FSIM6_bit           _BIT_ACCESS(COG1FSIM0,6)
// COG1FSIM0<FSIM7>
extern volatile __bit                   FSIM7               __at(0x34DF);	// @ (0x69B * 8 + 7)
#define                                 FSIM7_bit           _BIT_ACCESS(COG1FSIM0,7)
// COG1FSIM1<FSIM8>
extern volatile __bit                   FSIM8               __at(0x34E0);	// @ (0x69C * 8 + 0)
#define                                 FSIM8_bit           _BIT_ACCESS(COG1FSIM1,0)
// COG1FSIM1<FSIM9>
extern volatile __bit                   FSIM9               __at(0x34E1);	// @ (0x69C * 8 + 1)
#define                                 FSIM9_bit           _BIT_ACCESS(COG1FSIM1,1)
// PRG1FTSS<FTSS0>
extern volatile __bit                   FTSS0               __at(0x3CA8);	// @ (0x795 * 8 + 0)
#define                                 FTSS0_bit           _BIT_ACCESS(PRG1FTSS,0)
// PRG1FTSS<FTSS1>
extern volatile __bit                   FTSS1               __at(0x3CA9);	// @ (0x795 * 8 + 1)
#define                                 FTSS1_bit           _BIT_ACCESS(PRG1FTSS,1)
// PRG1FTSS<FTSS2>
extern volatile __bit                   FTSS2               __at(0x3CAA);	// @ (0x795 * 8 + 2)
#define                                 FTSS2_bit           _BIT_ACCESS(PRG1FTSS,2)
// PRG1FTSS<FTSS3>
extern volatile __bit                   FTSS3               __at(0x3CAB);	// @ (0x795 * 8 + 3)
#define                                 FTSS3_bit           _BIT_ACCESS(PRG1FTSS,3)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x10F7);	// @ (0x21E * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x10F6);	// @ (0x21E * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// COG1ASD0<G1ARSEN>
extern volatile __bit                   G1ARSEN             __at(0x34EE);	// @ (0x69D * 8 + 6)
#define                                 G1ARSEN_bit         _BIT_ACCESS(COG1ASD0,6)
// COG1ASD1<G1AS0E>
extern volatile __bit                   G1AS0E              __at(0x34F0);	// @ (0x69E * 8 + 0)
#define                                 G1AS0E_bit          _BIT_ACCESS(COG1ASD1,0)
// COG1ASD1<G1AS1E>
extern volatile __bit                   G1AS1E              __at(0x34F1);	// @ (0x69E * 8 + 1)
#define                                 G1AS1E_bit          _BIT_ACCESS(COG1ASD1,1)
// COG1ASD1<G1AS2E>
extern volatile __bit                   G1AS2E              __at(0x34F2);	// @ (0x69E * 8 + 2)
#define                                 G1AS2E_bit          _BIT_ACCESS(COG1ASD1,2)
// COG1ASD1<G1AS3E>
extern volatile __bit                   G1AS3E              __at(0x34F3);	// @ (0x69E * 8 + 3)
#define                                 G1AS3E_bit          _BIT_ACCESS(COG1ASD1,3)
// COG1ASD1<G1AS4E>
extern volatile __bit                   G1AS4E              __at(0x34F4);	// @ (0x69E * 8 + 4)
#define                                 G1AS4E_bit          _BIT_ACCESS(COG1ASD1,4)
// COG1ASD1<G1AS5E>
extern volatile __bit                   G1AS5E              __at(0x34F5);	// @ (0x69E * 8 + 5)
#define                                 G1AS5E_bit          _BIT_ACCESS(COG1ASD1,5)
// COG1ASD1<G1AS6E>
extern volatile __bit                   G1AS6E              __at(0x34F6);	// @ (0x69E * 8 + 6)
#define                                 G1AS6E_bit          _BIT_ACCESS(COG1ASD1,6)
// COG1ASD1<G1AS7E>
extern volatile __bit                   G1AS7E              __at(0x34F7);	// @ (0x69E * 8 + 7)
#define                                 G1AS7E_bit          _BIT_ACCESS(COG1ASD1,7)
// COG1ASD0<G1ASDAC0>
extern volatile __bit                   G1ASDAC0            __at(0x34EA);	// @ (0x69D * 8 + 2)
#define                                 G1ASDAC0_bit        _BIT_ACCESS(COG1ASD0,2)
// COG1ASD0<G1ASDAC1>
extern volatile __bit                   G1ASDAC1            __at(0x34EB);	// @ (0x69D * 8 + 3)
#define                                 G1ASDAC1_bit        _BIT_ACCESS(COG1ASD0,3)
// COG1ASD0<G1ASDBD0>
extern volatile __bit                   G1ASDBD0            __at(0x34EC);	// @ (0x69D * 8 + 4)
#define                                 G1ASDBD0_bit        _BIT_ACCESS(COG1ASD0,4)
// COG1ASD0<G1ASDBD1>
extern volatile __bit                   G1ASDBD1            __at(0x34ED);	// @ (0x69D * 8 + 5)
#define                                 G1ASDBD1_bit        _BIT_ACCESS(COG1ASD0,5)
// COG1ASD0<G1ASE>
extern volatile __bit                   G1ASE               __at(0x34EF);	// @ (0x69D * 8 + 7)
#define                                 G1ASE_bit           _BIT_ACCESS(COG1ASD0,7)
// COG1ASD0<G1ASREN>
extern volatile __bit                   G1ASREN             __at(0x34EE);	// @ (0x69D * 8 + 6)
#define                                 G1ASREN_bit         _BIT_ACCESS(COG1ASD0,6)
// COG1BLKF<G1BLKF0>
extern volatile __bit                   G1BLKF0             __at(0x3480);	// @ (0x690 * 8 + 0)
#define                                 G1BLKF0_bit         _BIT_ACCESS(COG1BLKF,0)
// COG1BLKF<G1BLKF1>
extern volatile __bit                   G1BLKF1             __at(0x3481);	// @ (0x690 * 8 + 1)
#define                                 G1BLKF1_bit         _BIT_ACCESS(COG1BLKF,1)
// COG1BLKF<G1BLKF2>
extern volatile __bit                   G1BLKF2             __at(0x3482);	// @ (0x690 * 8 + 2)
#define                                 G1BLKF2_bit         _BIT_ACCESS(COG1BLKF,2)
// COG1BLKF<G1BLKF3>
extern volatile __bit                   G1BLKF3             __at(0x3483);	// @ (0x690 * 8 + 3)
#define                                 G1BLKF3_bit         _BIT_ACCESS(COG1BLKF,3)
// COG1BLKF<G1BLKF4>
extern volatile __bit                   G1BLKF4             __at(0x3484);	// @ (0x690 * 8 + 4)
#define                                 G1BLKF4_bit         _BIT_ACCESS(COG1BLKF,4)
// COG1BLKF<G1BLKF5>
extern volatile __bit                   G1BLKF5             __at(0x3485);	// @ (0x690 * 8 + 5)
#define                                 G1BLKF5_bit         _BIT_ACCESS(COG1BLKF,5)
// COG1BLKR<G1BLKR0>
extern volatile __bit                   G1BLKR0             __at(0x3478);	// @ (0x68F * 8 + 0)
#define                                 G1BLKR0_bit         _BIT_ACCESS(COG1BLKR,0)
// COG1BLKR<G1BLKR1>
extern volatile __bit                   G1BLKR1             __at(0x3479);	// @ (0x68F * 8 + 1)
#define                                 G1BLKR1_bit         _BIT_ACCESS(COG1BLKR,1)
// COG1BLKR<G1BLKR2>
extern volatile __bit                   G1BLKR2             __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 G1BLKR2_bit         _BIT_ACCESS(COG1BLKR,2)
// COG1BLKR<G1BLKR3>
extern volatile __bit                   G1BLKR3             __at(0x347B);	// @ (0x68F * 8 + 3)
#define                                 G1BLKR3_bit         _BIT_ACCESS(COG1BLKR,3)
// COG1BLKR<G1BLKR4>
extern volatile __bit                   G1BLKR4             __at(0x347C);	// @ (0x68F * 8 + 4)
#define                                 G1BLKR4_bit         _BIT_ACCESS(COG1BLKR,4)
// COG1BLKR<G1BLKR5>
extern volatile __bit                   G1BLKR5             __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 G1BLKR5_bit         _BIT_ACCESS(COG1BLKR,5)
// COG1CON0<G1CS0>
extern volatile __bit                   G1CS0               __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 G1CS0_bit           _BIT_ACCESS(COG1CON0,3)
// COG1CON0<G1CS1>
extern volatile __bit                   G1CS1               __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 G1CS1_bit           _BIT_ACCESS(COG1CON0,4)
// COG1DBF<G1DBF0>
extern volatile __bit                   G1DBF0              __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 G1DBF0_bit          _BIT_ACCESS(COG1DBF,0)
// COG1DBF<G1DBF1>
extern volatile __bit                   G1DBF1              __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 G1DBF1_bit          _BIT_ACCESS(COG1DBF,1)
// COG1DBF<G1DBF2>
extern volatile __bit                   G1DBF2              __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 G1DBF2_bit          _BIT_ACCESS(COG1DBF,2)
// COG1DBF<G1DBF3>
extern volatile __bit                   G1DBF3              __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 G1DBF3_bit          _BIT_ACCESS(COG1DBF,3)
// COG1DBF<G1DBF4>
extern volatile __bit                   G1DBF4              __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 G1DBF4_bit          _BIT_ACCESS(COG1DBF,4)
// COG1DBF<G1DBF5>
extern volatile __bit                   G1DBF5              __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 G1DBF5_bit          _BIT_ACCESS(COG1DBF,5)
// COG1DBR<G1DBR0>
extern volatile __bit                   G1DBR0              __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 G1DBR0_bit          _BIT_ACCESS(COG1DBR,0)
// COG1DBR<G1DBR1>
extern volatile __bit                   G1DBR1              __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 G1DBR1_bit          _BIT_ACCESS(COG1DBR,1)
// COG1DBR<G1DBR2>
extern volatile __bit                   G1DBR2              __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 G1DBR2_bit          _BIT_ACCESS(COG1DBR,2)
// COG1DBR<G1DBR3>
extern volatile __bit                   G1DBR3              __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 G1DBR3_bit          _BIT_ACCESS(COG1DBR,3)
// COG1DBR<G1DBR4>
extern volatile __bit                   G1DBR4              __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 G1DBR4_bit          _BIT_ACCESS(COG1DBR,4)
// COG1DBR<G1DBR5>
extern volatile __bit                   G1DBR5              __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 G1DBR5_bit          _BIT_ACCESS(COG1DBR,5)
// COG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x349F);	// @ (0x693 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(COG1CON0,7)
// COG1CON1<G1FDBS>
extern volatile __bit                   G1FDBS              __at(0x34A6);	// @ (0x694 * 8 + 6)
#define                                 G1FDBS_bit          _BIT_ACCESS(COG1CON1,6)
// COG1FIS0<G1FIS0>
extern volatile __bit                   G1FIS0              __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 G1FIS0_bit          _BIT_ACCESS(COG1FIS0,0)
// COG1FIS0<G1FIS1>
extern volatile __bit                   G1FIS1              __at(0x34C9);	// @ (0x699 * 8 + 1)
#define                                 G1FIS1_bit          _BIT_ACCESS(COG1FIS0,1)
// COG1FIS1<G1FIS10>
extern volatile __bit                   G1FIS10             __at(0x34D2);	// @ (0x69A * 8 + 2)
#define                                 G1FIS10_bit         _BIT_ACCESS(COG1FIS1,2)
// COG1FIS1<G1FIS11>
extern volatile __bit                   G1FIS11             __at(0x34D3);	// @ (0x69A * 8 + 3)
#define                                 G1FIS11_bit         _BIT_ACCESS(COG1FIS1,3)
// COG1FIS1<G1FIS12>
extern volatile __bit                   G1FIS12             __at(0x34D4);	// @ (0x69A * 8 + 4)
#define                                 G1FIS12_bit         _BIT_ACCESS(COG1FIS1,4)
// COG1FIS1<G1FIS13>
extern volatile __bit                   G1FIS13             __at(0x34D5);	// @ (0x69A * 8 + 5)
#define                                 G1FIS13_bit         _BIT_ACCESS(COG1FIS1,5)
// COG1FIS1<G1FIS14>
extern volatile __bit                   G1FIS14             __at(0x34D6);	// @ (0x69A * 8 + 6)
#define                                 G1FIS14_bit         _BIT_ACCESS(COG1FIS1,6)
// COG1FIS0<G1FIS2>
extern volatile __bit                   G1FIS2              __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 G1FIS2_bit          _BIT_ACCESS(COG1FIS0,2)
// COG1FIS0<G1FIS3>
extern volatile __bit                   G1FIS3              __at(0x34CB);	// @ (0x699 * 8 + 3)
#define                                 G1FIS3_bit          _BIT_ACCESS(COG1FIS0,3)
// COG1FIS0<G1FIS4>
extern volatile __bit                   G1FIS4              __at(0x34CC);	// @ (0x699 * 8 + 4)
#define                                 G1FIS4_bit          _BIT_ACCESS(COG1FIS0,4)
// COG1FIS0<G1FIS5>
extern volatile __bit                   G1FIS5              __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 G1FIS5_bit          _BIT_ACCESS(COG1FIS0,5)
// COG1FIS0<G1FIS6>
extern volatile __bit                   G1FIS6              __at(0x34CE);	// @ (0x699 * 8 + 6)
#define                                 G1FIS6_bit          _BIT_ACCESS(COG1FIS0,6)
// COG1FIS0<G1FIS7>
extern volatile __bit                   G1FIS7              __at(0x34CF);	// @ (0x699 * 8 + 7)
#define                                 G1FIS7_bit          _BIT_ACCESS(COG1FIS0,7)
// COG1FIS1<G1FIS8>
extern volatile __bit                   G1FIS8              __at(0x34D0);	// @ (0x69A * 8 + 0)
#define                                 G1FIS8_bit          _BIT_ACCESS(COG1FIS1,0)
// COG1FIS1<G1FIS9>
extern volatile __bit                   G1FIS9              __at(0x34D1);	// @ (0x69A * 8 + 1)
#define                                 G1FIS9_bit          _BIT_ACCESS(COG1FIS1,1)
// COG1FSIM0<G1FSIM0>
extern volatile __bit                   G1FSIM0             __at(0x34D8);	// @ (0x69B * 8 + 0)
#define                                 G1FSIM0_bit         _BIT_ACCESS(COG1FSIM0,0)
// COG1FSIM0<G1FSIM1>
extern volatile __bit                   G1FSIM1             __at(0x34D9);	// @ (0x69B * 8 + 1)
#define                                 G1FSIM1_bit         _BIT_ACCESS(COG1FSIM0,1)
// COG1FSIM1<G1FSIM10>
extern volatile __bit                   G1FSIM10            __at(0x34E2);	// @ (0x69C * 8 + 2)
#define                                 G1FSIM10_bit        _BIT_ACCESS(COG1FSIM1,2)
// COG1FSIM1<G1FSIM11>
